### I) load dataset

In [30]:
import pandas as pd

df = pd.read_csv('../data/students.csv', index_col=[0])

In [31]:
df.head()

            Age     Sex      Grade Employed
ID_student
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no

### II) select only  object features

In [34]:
df_cat_feature = df.select_dtypes(exclude="number")
df_cat_feature.head()

               Sex      Grade Employed
ID_student
1             Male  1st Class      yes
2           Female  2nd Class       no
3             Male  1st Class       no
4           Female  2nd Class       no
5             Male  1st Class       no

In [35]:
df_cat_feature.info()

<class 'pandas.core.frame.DataFrame'>
Index: 232 entries, 1 to 232
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       232 non-null    object
 1   Grade     232 non-null    object
 2   Employed  232 non-null    object
dtypes: object(3)
memory usage: 7.2+ KB

### III) determin all dictinct vlaue of categorical features

In [36]:
df_cat_feature['Grade'].unique()

array(['1st Class', '2nd Class', '3rd Class'], dtype=object)

### IV) display frequency distribution of all categorical features

In [37]:
df_cat_feature["Employed"].value_counts()

Employed
no     133
yes     99
Name: count, dtype: int64

In [38]:
df_cat_feature.Sex.value_counts()

Sex
Male      136
Female     96
Name: count, dtype: int64

In [39]:
df_cat_feature[["Grade", "Sex"]].value_counts()

Grade      Sex
1st Class  Male      56
2nd Class  Male      48
3rd Class  Female    48
2nd Class  Female    32
3rd Class  Male      32
1st Class  Female    16
Name: count, dtype: int64

### V) encode all categorical values

In [40]:
df_cat_feature.Grade.unique()

array(['1st Class', '2nd Class', '3rd Class'], dtype=object)

In [41]:
# Label encoding for  Grade feature
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df_cat_feature['Grade'] = encoder.fit_transform(df.Grade)

In [42]:
df_cat_feature.Sex.unique()

array(['Male', 'Female'], dtype=object)

In [43]:
# Encoding for  Sex  feature
df_cat_feature['Sex'] = ((df.Sex=="Male")+0)

In [44]:
df_cat_feature.Sex.unique()

array([1, 0])

In [45]:
df_cat_feature.Employed.unique()

array(['yes', 'no'], dtype=object)

In [46]:
df_cat_feature['Employed'] = ((df.Employed=="yes")+0)

In [47]:
df_cat_feature.head()

            Sex  Grade  Employed
ID_student
1             1      0         1
2             0      1         0
3             1      0         0
4             0      1         0
5             1      0         0